; domain
(define
	(domain world-of-blocks)
	(:requirements :adl)
	(:predicates
		(on-top ?x ?y)
		(on-floor ?x)
		(clear ?x)
		(holding ?x)
	)
	; przesuñ paczkê na pod³ogê
	(:action podnies-z-paczki
		:parameters (?x ?z)
		:precondition
		(and
			(clear ?x)
			(on-top ?x ?z)
			(not (exists (?p) (holding ?p)))
		)
		:effect
		(and
			(not (on-top ?x ?z))
			(clear ?z)
			(holding ?x)
		)
	)
	; opusc na paczke
	(:action opusc-na-paczke
		:parameters (?y ?x)
		:precondition
		(and
			(holding ?x)
			(clear ?y)
			(not (= ?x ?y))
		)
		:effect
		(and
			(on-top ?x ?y)
			(not (clear ?y))
			(not (holding ?x))
		)
	)
	; opuszczenie na podloge
	(:action opusc-na-podloge
	    :parameters (?x)
	    :precondition
	    (and
	        (holding ?x)
	    )
	    :effect
	    (and
	        (on-floor ?x)
	        (not (holding ?x))
	    )
	)
	; podnoszenie z podlogi
	(:action podnies-z-podlogi
	    :parameters (?x)
	    :precondition
	    (and
	        (not (exists (?p) (holding ?p)))
	        (on-floor ?x)
	        (clear ?x)
	    )
	    :effect
	    (and
	        (holding ?x)
	        (not (on-floor ?x))
	    )
 
	)
)

; problem
(define (problem p1)
	(:domain world-of-blocks)
	(:objects a b c d e f)
	(:init
		(clear a)
		(clear b)
		(clear c)
		(clear d)
		(clear e)
		(clear f)
		(on-floor a)
		(on-floor b)
		(on-floor c)
		(on-floor d)
		(on-floor e)
		(on-floor f)
	)
	(:goal
		(exists (?p) 
			(and 
				(on-floor ?p)
				(not (exists (?y) (and (not (= ?p ?y)) (or (on-floor ?y) (holding ?y)))))
			)
		)
	)
)

; plan
1. (podnies-z-podlogi a)
   deleted: (on-floor a)
   added: (holding a)
   goals met: 0 of 1
2. (opusc-na-paczke b a)
   deleted: (clear b) (holding a)
   added: (on-top a b)
   goals met: 0 of 1
3. (podnies-z-podlogi c)
   deleted: (on-floor c)
   added: (holding c)
   goals met: 0 of 1
4. (opusc-na-paczke a c)
   deleted: (clear a) (holding c)
   added: (on-top c a)
   goals met: 0 of 1
5. (podnies-z-podlogi d)
   deleted: (on-floor d)
   added: (holding d)
   goals met: 0 of 1
6. (opusc-na-paczke c d)
   deleted: (clear c) (holding d)
   added: (on-top d c)
   goals met: 0 of 1
7. (podnies-z-podlogi e)
   deleted: (on-floor e)
   added: (holding e)
   goals met: 0 of 1
8. (opusc-na-paczke d e)
   deleted: (clear d) (holding e)
   added: (on-top e d)
   goals met: 0 of 1
9. (podnies-z-podlogi f)
   deleted: (on-floor f)
   added: (holding f)
   goals met: 0 of 1
10. (opusc-na-paczke e f)
   deleted: (clear e) (holding f)
   added: (on-top f e)
   goals met: 1 of 1
